# SymbolicLineInvalidPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..SymbolicLineInvalidPlane Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Symbolic Element refers to a Work Plane with unacceptable normal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SymbolicLineInvalidPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SymbolicLineInvalidPlane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SymbolicLineInvalidPlane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace